; domain
(define (domain delivery)
  (:requirements :strips :typing)

  (:types
    agent package location - object
  )

  (:predicates
    (at ?a - agent ?l - location)
    (has ?a - agent ?p - package)
    (in ?p - package ?l - location)
    (connected ?from - location ?to - location)
    (requested ?p - package ?dest - location)
    (delivered ?p - package)
    (available ?a - agent)
  )

  (:action pick-up
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (at ?a ?l) (in ?p ?l) (available ?a))
    :effect (and 
              (has ?a ?p)
              (not (in ?p ?l))
            )
  )

  (:action move
    :parameters (?a - agent ?from - location ?to - location)
    :precondition (and (at ?a ?from) (connected ?from ?to) (available ?a))
    :effect (and 
              (at ?a ?to)
              (not (at ?a ?from)))
  )

  (:action drop-off
    :parameters (?a - agent ?p - package ?l - location)
    :precondition (and (has ?a ?p) (at ?a ?l) (requested ?p ?l))
    :effect (and 
              (delivered ?p)
              (in ?p ?l)
              (not (has ?a ?p)))
            )
  )

; problem
(define (problem delivery-dynamic)
(:domain delivery)
(:objects
  drone - agent
  medicalPkg - package
  hospital depot disasterArea - location
)
(:init
  (at drone depot) ; Drone starts at the depot
  (in medicalPkg depot) ; Package starts at the depot
  (connected depot hospital)
  (connected hospital disasterArea)
  (requested medicalPkg disasterArea)
  (not (connected depot disasterArea)) ; Must go through hospital
  (available drone)
)
(:goal (delivered medicalPkg))
)

; plan
1. (pick-up drone medicalpkg depot)
   deleted: (in medicalpkg depot)
   added: (has drone medicalpkg)
   goals met: 0 of 1
2. (move drone depot hospital)
   deleted: (at drone depot)
   added: (at drone hospital)
   goals met: 0 of 1
3. (move drone hospital disasterarea)
   deleted: (at drone hospital)
   added: (at drone disasterarea)
   goals met: 0 of 1
4. (drop-off drone medicalpkg disasterarea)
   deleted: (has drone medicalpkg)
   added: (delivered medicalpkg) (in medicalpkg disasterarea)
   goals met: 1 of 1
